import { Orderstypes } from './../interfaces/orderstypes';

export const clientData: Orderstypes[] = [
    {
        case: 'طلب كاش العميل ماكد على المندوب والمندوب تأخر فالطلب اكتر من ساعه ونص',
        action: 'YES'
    },

    {
        case: 'المندوب اخطأ فى الطلب ولم ياتى بالاغراض بشكل مظبوط',
        action: 'YES'
    },

    {
        case: 'العميل طلب من مطعم والمندوب لقاه مغلق تعويض العميل ب 5 ريال /العميل ابلغنا ان المطعم كان مفتوح فالابلكيشن',
        action: 'YES'
    },

    {
        case: 'الطلب فود اونلاين و الفاتوره واضح انها في ايتم ناقص ',
        action: 'YES'
    },

    {
        case: 'العميل لم ياكد على المندوب فالمحادثة ومنتظر الطلب اكتر من ساعه ونص',
        action: 'NO'
    },

    {
        case: 'المندوب اخذ فلوس اكتر من حق الطلب من العميل',
        action: 'NO'
    },

    {
        case: 'المندوب اخذ فلوس زيادة لياتى بصرف',
        action: 'NO'
    },

    {
        case: 'العميل اكد على المندوب فالمحادثة ومنتظر الطلب اكتر من ساعه ونص',
        action: 'YES'
    },

];


export const delegateData: Orderstypes[] = [
    {
        case: 'التعويض بقيمة الطلب',
        action: `- توضيح سبب عدم استلام العميل الطلب
        \n-مدة الطلب لا تتجاوز 70 دقيقة (فوود) و 90 دقيقة (نورمال)`
    },
    {
        case: 'الفاتورة و الاغراض',
        action: `-الفاتورة يكون واضح بها الوقت و التاريخ و اسم المطعم 
        \n-الفاتورة واضح بها ان الاغراض نفس اللى عميل طالبها فى التطبيق
        \n-صورة الاغراض (مهمة) و واضحة `
    },
    {
        case: 'Validating Some Excuses For Couriers',
        action: `1- تعويض اذا كان صورة الفاتورة مش واضحة:
        \nاذا كان المندوب قديم (اكثر من 100 طلب) 
        \n2- تعويض من غير صورة الاغراض:
        \nاذا كان المندوب قديم (اكثر من 50 طلب) `
    },
    {
        case: 'Couriers Rejection',
        action: `- اذا كان المندوب مش ملتزم بالسياسة:
        \n- مدة الطلب تتجاوز 70 دقيقة (فوود) و 90 دقيقة (نورمال) ماعدا طلبات البيك او المطاعم الكبيرة 
        \n- المندوب اشترى الطلب من مطعم اخر بدون الرجوع للعميل و العميل رفض استلام الطلب
        \n- المندوب تجاوز على العميل او تحدث للعميل بشكل غير لائق 
        \n- المندوب سلم الطلب للعميل بدون ما العميل يدفع (اونلاين – كاش) 
        \n- التطبيق لا يعوض عن (بطاقات الشحن – بطاقات الالعاب الاكترونية – بطاقات الاشتراكات)  
        `,
    }

]


export const restaurantData: Orderstypes[] = [
    {
        case: 'طلب FOOD ONLINE المندوب استلم الطلب وسلم الى العميل والعميل لم يدفع قيمة الطلب',
        action: 'YES'
    },


    {
        case: 'الطلب تم الغاءه من قبل الدعم بسبب ان الطلب Fake ولم يستغرق وقت على الداش بورد والمطعم قام بتحضير الطلب ',
        action: 'No'
    },

    {
        case: 'المطعم حضر الطلب والمندوب لم يذهب للمطعم لاستلامة ',
        action: 'YES'
    },

    {
        case: ' fake order ولم يتم الغاءه من قبل الدعم الفنى والمطعم قام بتحضيره ',
        action: 'YES'
    },

    {
        case: 'اذا قام العميل بتحويل اى مبالغ مالية للمندوب قبل استلامه اى طلب ',
        action: 'No'
    },
]