import { Orderstypes } from './../interfaces/orderstypes';
import { Tabledata } from 'src/app/interfaces/tabledata';


export const generalData: Tabledata[] = [
    {
        case: 'المكافأت',
        situation: ['المكافأة الترحيبية 5 طلبات "100 ريال"', ' مكافأة ال 6 طلبات "50 ريال"', 'مكافأة ال 10 طلبات "100 ريال"', 'مكافأة ال 15 طلب "200 ريال"'],
        actions: [[' يجب ان يتم التواصل مع الشقردي من قبل قسم الترحيب من خلال واتساب، وتبدأ المكافأة من وقت ارسال الرسالة له عبر واتساب ويجب ان يتم توصيل الطلبات في خلال 48 ساعه.'], ['يجب ان يتم توصيل 6 طلبات في خلال 24 ساعه في نفس اليوم'], [' يجب ان يتم توصيل 10 طلبات في خلال 24 ساعه في نفس اليوم'], [' يجب ان يتم توصيل 15 طلبات في خلال 24 ساعه  في نفس اليوم']]
    },
    {
        case: 'السحب',
        situation: ['السحب متاح فقط عن طريق البنك الأهلى'],
        actions: [['يجب ان يكون رقم الحساب مكون من 14 رقم ورقم الايبان يبدأ ب SA', ' يجب ان يترك الشقردي 10 ريال بمحفظته حتى يتمكن من السحب']]
    },
    {
        case: 'تفعيل الحساب',
        situation: ['ذا اراد الشقردي تفعيل حسابه،'],
        actions: [[`صحيح واذا لم يستطع ارفاقها نطلب منه ارسالها لنا ثم نقوم برفع طلب على Freshdesk لقسم التفعيل ورفع رقم الشقردي مع البيانات والصور المرسلة ليتم تفعيل حسابه ونوضح للشقردي رقم الطلب" Ticket"
        نطلب منخ ارفاق بياناته كامله بشكل `]]
    },
    {
        case: 'تأكيد استلام المطعم',
        situation: ['اذا قام الشقردي بالتواصل معنا بانه قام بتوصيل المطعم والمطعم لم يقم بالتأكيد', 'اذا لم يكن واضح لدينا بالطلب انه متواصل او لم يصل بالخريطه'],
        actions: [['نقوم بمراجعة الطلب "خريطة، دردشة"، اذا كان متواصل مع العميل وعلى الخريطة وصل الى المطعم ومنزل العميل وارفق فاتورة المطعم بالدردشة مع العميل او من خلال خدمة العملاء، نقوم بتاكيد الطلب من خلالنا'], [`يجب ان نقوم بالتواصل مع المطعم للتاكد من استلام الشقردي للطلب.
        ونقوم بتاكيد الاستلام`]]

    },
    {
        case: 'تغيير رقم الجوال',
        situation: ['في حالة رغبة الشقردي بتغيير رثم الجوال الخاصة به'],
        actions: [[`نطلب منه ان يقوم بالتسجيل بالرقم الجديد وارفاق بياناته كامله بشكل صحيح،
        ثم ناخذ الرقم القديم والرقم الجديد ونرفع به طلب من خلال Freshdesk لقسم التفعيل ليتم غلق الحساب القديم وتفعيل الحساب الجديد
    \n\n* "لا تنسي ان تنظر بمحفظة الشقردي في الحساب القديم للتاكد من عدم وجود اي مبلغ مالي بحسابه، واذا كان هناك مبلغ بالحساب القديم قم برفع طلب للقسم المالي ليتم تحويلها من حساب الشقردي القديم الى الحساب الجديد واوضح للشقردي ذلك وقم باعطائه رقم الطلب على Freshdesk"*`]]

    },
    {
        case: ' التعويض على قيمة المشوار',
        situation: ['اذا قام الشقردي بطلب تعويض لذهابه لمتجر وهو مغلق'],
        actions: [['نعتذر منه ونوضح له ان التطبيق لا يعوض على قيمة المشوار']]

    },
    {
        case: ' الدفع كاش/اونلاين',
        situation: ['في حالة الطلب مازال قائم', 'في حالة تم انهاء الطلب'],
        actions: [[`يتم اخبار المندوب بارسال صورة من الفاتورة الصادرة من قبل المطعم في الطلب.
        * بمجرد ارسال الفاتورة يتم رفع طلب/ticket على الfreshdesk لتيم الcash، وتوضيح دفع المندوب بالمطعم مع توضيح رقم الطلب والفاتورة`], [` يتم اخبار المندوب بارسال صورة من الفاتورة الصادرة من قبل المطعم بالدعم الفني.
        * بمجرد ارسال الفاتورة يتم رفع طلب/ticket على الfreshdesk لتيم الcash، وتوضيح دفع المندوب بالمطعم مع توضيح رقم الطلب والفاتورة`]]

    }

];

export const courierData: Orderstypes[] = [
    {
        case: ' اذا اوضح لنا الشقردي رغبته في الغاء الطلب',
        action: ' يجب ان نسأل الشقردي عن سبب الغاء الطلب '
    },
    {
        case: 'الشقردي تأخر بتوصيل الطلب على العميل ',
        action: 'برجاء ابلاغ المندوب بالتواجد في النقاط الحمراء علي الخريطه  المناطق الحيويه و الاسواق و نقوم باعاده تنشيط الحساب '
    },

    {
        case: 'في حالة تأخر الشقردي للمرة الأولى بتوصيل الطلب الى العميل',
        action: `"Foodstuffs او Normal" ، يتم ارسال اشعار له وتحذيره من خلال الDashboard لكي لا يعرض حسابه الى الايقاف المؤقت في المرات القادمة.        `
    },


    {
        case: 'في حالة تأخر الشقردي للمرة الثانية بتوصيل الطلب الى العميل',
        action: ` "Foodstuffs او On demond"، يتم ارسال اشعار وايقاف حساب الشقردي لمدة ساعتين.
                \nالحد الأقصى لوقت توصيل الطلب on demond هو: 90 دقيقة
                \nالحد الأقصى لوقت توصيل الطلب Foodstuffs هو: 70 دقيقة`
    },
    {
        case: 'اذا قام الشقردي باستلام الطلب',
        action: ' نعتذر منه عن ذلك ونوضح له ان حقه محفوظ'
    },
    {
        case: 'Freshdesk اذا كان الطلب',
        action: ' يتم رفع طلب تعويض له بقيمة الطلب على On demond, Foodstuffs cash او  Foodstuffs online وقام الشقردي بالدفع في المطعم'
    },
    {
        case: 'اذا كان online وقام الشقردي بالدفع في المطعم',
        action: ' نطلب منه ارسال صورة الفاتورة وصورة الاغراض ليتم ارفاقها بطلب التعويض. * نعطي الشقردي الرقم المرجعي الموضح ب Freshdesk.        '
    },
    {
        case: ' في حالة المطعم مغلق/طلب Normal',
        action: `نقوم بالتوضيح للشقردي ان يقوم بارسال صورة للمتجر وهو مغلق للعميل بمحادثة الطلب،
        ويتم الغاء الطلب.`
    },
    {
        case: ' اذا كان الطلب Foodstuffs',
        action: `يتم رفع تيكت ل Partner care من خلال Freshdesk وتوضيح ان اوقات العمل مختلفة في التطبيق`
    },
    {
        case: 'في حالة عدم توافر الاغراض بالمطعم/اذا كان الطلب Foodstuffs',
        action: `نقوم بالتواصل مع المتجر للتأكد من عدم توافر الاغراض الان ام غير متوافرة بشكل نهائى وتم حذفها بالمنيو.ويتم رفع تيكت ل Partner care من خلال Freshdesk وتوضيح ذلك.
        ثم نقوم بالغاء الطلب`
    },
    {
        case: 'المندوب ارد الغاء الطلب لعدم توافر قيمة الطلب',
        action: `* نقوم بتحذير الشقردي والتوضيح له بانه يجب ان يكون لديه مبلغ كافي 200 ريال كحد ادنى عند استقباله للطلبات.
        * نقوم بالتواصل مع العميل ونعتذر له ونسأل اذا اراد تغيير الشقردي بالطلب ام لا.
    `
    }

];

export const compensationData: Tabledata[] = [
    {
        case: 'التعويض ',
        situation: ['لتعويض بقيمة الطلب', 'الفاتورة و الاغراض', 'التعويض بقيمة المشوار', 'Validating Some Excuses For Couriers'],
        actions: [[' توضيح سبب عدم استلام العميل الطلب', 'مدة الطلب لا تتجاوز 70 دقيقة (فوود) و 90 دقيقة (نورمال)', 'التعويض بقيمة المشوا'],
        [' الفاتورة يكون واضح بها الوقت و التاريخ و اسم المطعم', 'الفاتورة واضح بها ان الاغراض نفس اللى عميل طالبها فى التطبيق', 'صورة الاغراض (مهمة) و واضحة'],
        ['لو العميل ارسل للمندوب موقع اخر بعد وصول المندوب الموقع المحدد فى التطبيق و العميل رفض دفع الفرق', 'اذا كان المندوب قديم (اكثر من 100 طلب) و ملوش تعويض عن قيمة الطلب'],
        [`تعويض اذا كان صورة الفاتورة مش واضحة:
        اذا كان المندوب قديم (اكثر من 100 طلب)
        `, ` تعويض من غير صورة الاغراض:
        اذا كان المندوب قديم (اكثر من 50 طلب)
        `]]
    },
    {
        case: 'لا يعوض',
        situation: [' اذا كان المندوب غير ملتزم بالسياسة'],
        actions: [[' مدة الطلب تتجاوز 70 دقيقة (فوود) و 90 دقيقة (نورمال) ماعدا طلبات البيك او المطاعم الكبيرة', 'المندوب اشترى الطلب من مطعم اخر بدون الرجوع للعميل و العميل رفض استلام الطلب', 'المندوب تجاوز على العميل او تحدث للعميل بشكل غير لائق', 'المندوب سلم الطلب للعميل بدون ما العميل يدفع (اونلاين – كاش)', ' التطبيق لا يعوض عن (بطاقات الشحن – بطاقات الالعاب الاكترونية – بطاقات الاشتراكات)']]
    }

]