import { Multitabledata } from '../interfaces/multitabledata';
import { Tabledata } from './../interfaces/tabledata';

export const cashData: Tabledata[] = [
  {
    case: 'المندوب لم يصل للمطعم علي الخريطة',
    situation: [
      '(المندوب يرد علي الاتصال ) mins 15 after',
      '( المندوب يرد ولا يريد توصيل الطلب ) mins 15 after',
      '( المندوب لا يرد لكنه متواصل مع العميل فالدردشة وموضح انه قريب من المطعم  ) mins 15 after',
      '( المندوب لا يرد علي الاتصال 3 مرات ) mins 15 after',
    ],
    actions: [

      ['الاتصال بالمندوب ( اخباره بسرعة التوجه للمطعم حتي لا يواجه العقوبة اذا تاخر الطلب عن 60 دقيقة ) '],
      ['n action ضد المندوب حسب ال action اتخاذ', 'التواصل مع العميل والاعتذار منه بسبب حدوث ظرق طارئ للمندوب سوف يتم تغير المندوب ومتابعة الطلب له', 'متاعبة الطلب لحين قبوله من مندوب اخر ثم التواصل معه واخباره بسرعة توصيل الطلب للعميل'],
      ['يترك الطلب مع كتابة نوت فالطلب ان المندوب متواصل مع العميل'],
      ['التواصل مع العميل واخباره ان سوف يتم تغير المندوب وسيتم متابعة الطلب حتي يصل له', 'متاعبة الطلب لحين قبوله من مندوب اخر ثم التواصل معه واخباره بسرعة توصيل الطلب للعميل', 'N ACTION اتخاد اجراء ضد المندوب الاول حسب ال'],

    ]
  },


  {
    case: '( up picking ) المندوب وصل للمطعم علي الخريطة لكن لم يتم تحويل حالة الطلب ال',
    situation: [
      '( المندوب  يرد علي الاتصال) mins 15 after',
      '( المندوب لا يرد علي الاتصال   ) mins 15 after',
    ],
    actions: [
      ['الاتصال بالمندوب واخباره بتحويل حالة الطلب الي جاري استلام الطلب لكي يظهر للعميل انك تستلم الطلب من المطعم الحي'],
      ['اذا لم يتم التجواب من قبل المندوب تحويل حالة الطلب من قبل الدعم']
    ]

  },

];

export const cancelledOnline: Tabledata[] = [
  {
    case: 'المندوب تأخر في المتجر عن  35 دقيقة  ',
    situation: [
      'المندوب علي تواصل مع العميل في المحادثه',
      'المندوب ليس علي تواصل مع العميل في المحادثه',
      'المندوب بيستلم من اكثر من متجر',
      'المندوب استلم الطلب ويواجه مشكله في ارفاق الفاتوره ',
      'المندوب معاه اكثر من طلب'
    ],
    actions: [

      ['كتابه نوت في الطلب مع متابعته '],
      ['التواصل مع المندوب لمتابعه الطلب وابلاغه بارفاق الفاتوره في التطبيق و بتغير المرحله للاتجاه للعميل '],
      ['التواصل مع المندوب و ابلاغه عند استلامه كامل الطلبات بتغير المرحله '],
      ['ابلاغ المندوب بارفاق الفاتوره في المحادثه و ارفاقها للمندوب '],
      ['التأكد ان الطلبين لن يتأخروا و ابلاغ المندوب انه في حاله قبول اكثر من طلب التأكد من توصيلهم في الوقت المحدد '
        , `في حاله ان الطلبات ستتأخر بسبب بعد المسافة او المطعم اتخاذ الجراء المناسب مع المندوب حسب action plan 
      التواصل مع العميل اولا لابلاغه و عرض عليه تغير المندوب ومتابعه الطلب للعميل `],
    ]
  },

  {
    case: 'المندوب وصل المطعم و المطعم مغلق  ',
    situation: [
      'التواصل مع المندوب وابلاغه بارفاق صوره للمطعم و هو مغلق',
    ],
    actions: [
      ['التواصل مع العميل اذا يبي من مطعم تاني او الغاء الطلب  '],
    ]
  },
  {
    case: 'المندوب وصل لبيت العميل علي الخريطه   ',
    situation: [
      'المندوب يرد ',
      'المندوب لا يرد '
    ],
    actions: [
      ['ابلاغه بتغير المرحله و استكمال الطلب فور تسليمه   '],
      ['التواصل مع العميل للتأكد من استلامه الاغراض و استكمال الطل'],

    ]
  }

];

export const cancelledOffline: Multitabledata[] = [
  {
    case: 'المتجر مغلق',
    action:
      'نطلب منه ارسال صورة للمتجر المغلق والتاكد من اسم المطعم ثم الغاء الطلب',
  },


  {
    case: 'الاغراض غير متوفرة',
    action: 'الغاء الطلب',
  },


  {
    case: 'العميل يريد الالغاء',
    action:
      'التاكد من ان المندوب لم يستلم الطلب او التاكد من خلال الدردشة ان المندوب موافق علي الالغاء ثم الغاء الطلب',
  },


  {
    case: 'المندوب وضح ان العميل رفض استلام الطلب ( المندوب غير ماكد علي العميل في الدردشة )',
    action: 'الغاء الطلب وعدم رفع طلب تعويض للمندوب',
  },

  {
    case: 'المندوب وضح ان العميل رفض استلام الطلب ( المندوب ماكد علي العميل في الدردشة )',
    action: 'الغاء الطلب و رفع طلب تعويض للمندوب',
  },

  {
    case: 'المندوب احضر الاغراض من مطعم اخر',
    action: 'الغاء الطلب',
  },
];

export const courierOnline: Tabledata[] = [
  {
    case: `المندوب وصل علي الخريطه 
    الطلب مر عليه 60 دقيقة`,

    situation: ['الطلب اون لاين ( العميل دافع و لم يؤكد الاستلام ) العميل يرد',
      'الطلب اون لاين (العميل دافع و لم يؤكد الاستلام ) التطبيق معلق مع العميل ',
      'الطلب اون لاين اقل من 200 ريال  ( العميل دافع و لم يؤكد الاستلام )العميل لايرد 3 مرات ',
      'الطلب اون لاين اكثر من 200 ريال  ( العميل دافع و لم يؤكد الاستلام )العميل لايرد 3 مرات ',
      'الطلب كاش المندوب يرد ', 'الطلب كاش المندوب لا يرد '],
    actions: [
      ['التأكد من ان العميل استلم الطلب كامل و لا يوجد مشكله و طلب من العميل تأكيد الاستلام '],
      ['تأكيد الاستلام للعميل وكتابه نوت بالطلب '],
      ['التأكد من الشات والخريطة ان العميل استلم الطلب و استكماله '],
      ['يترك الطلب لحين استكماله من قبل العميل '],
      ['التواصل مع المندوب لاستكمال الطلب', 'التطبيق معلق مع المندوب استكمال الطلب و كتابه نوت بالطلب '],
      ['التواصل مع العميل للتأكد من استلام الطلب و استكماله وكتابه نوت بالطلب ', 'العميل لا يرد التأكد من المحادثه والخريطة  و استكمال الطلب بناء عليها مع كتابه نوت بالطلب ']
    ],
  },

  {
    case: ' المندوب امام منزل العميل ومعه الطلب والعميل لا يتجواب لمدة اكثر من 15 دقيقة',
    situation: ['العميل عنده طلبات اون لاين و عميل جاد (الطلب اون لاين - كاش )'],
    actions: [
      ['نطلب منه تصوير الاغراض ورفعها في الدردشة ثم الغاء الطلب و رفع طلب تعويض للمندوب']
    ], 
  },
  {
    case: ' العميل عنده مشكله بالطلب لم يؤكد الاستلام ( اون لاين )',
    situation: ['سئ /مختلف عن الطلب الاساسي '],
    actions: [
      ['ابلاغ العميل بارفاق صور للاغراض و مراجعه الفاتورة ورفع طلب تعويض للعميل ']
    ], 
  },
  {
    case: 'الطلب اون لاين ',
    situation: ['العميل ما دفع الطلب (العميل يرد )','العميل ما دفع الطلب (العميل لا يرد ) ','الطلب ناقص و الطلب فوود اونلاين ','اذا المندوب سيارته تعطلت','اذا المطعم مغلق او المنتج غبر متوقر بشكل دائم او خلص على مدار اليوم '],
    actions: [
      [
        `التواصل مع العميل و معرفه طريقه الدفع 
        \n1- دفع عن طريق التطبيق التأكد من قسم الpayment وكتابه نوت في الطلب 
      2-دفع للمندوب كاش تغير طريقة الدفع و استكمال الطلب `
      ],
      ['التواصل مع المندوب للتأكد انه استلم حقه وتغير طريقة الدفع '],
      ['يتم رفع تيكت لارجاع المبلغ قيمة الطلب الناقص للعميل '],
      ['يتم ارسال للمندوب default msg انه اذا تكرر الامر مرة اخرى سيتم ايقاف الحساب '],
      ['يتم رفع تيكت للبارتنر كير']
    ], 
  },
];

export const courierOffline: Tabledata[] = [
  {
    case: 'المندوب يريد الغاء الطلب لانه لا يتستطيع توصيله لاي سبب',
    actions: [['تغير المندوب', 'التواصل مع العميل لاخباره بتغير المندوب']],
    situation: []
  },
];
