import { Tabledata } from './../interfaces/tabledata';

export const cashData: Tabledata[] = [
    {

        case: ' المندوب لم يصل للمطعم  علي الخريطة ',
        situation: ['after 15 mins ( المندوب يرد  )', 'after 15 mins ( المندوب يرد والمطعم مغلق  )', 'after 15 mins ( المندوب  يرد ولا  يريد توصيل الطلب   )', 'after 15 mins ( المندوب لا  يرد لكنه متواصل مع العميل فالدردشة وموضح انه قريب من المطعم    )', 'after 15 mins ( المندوب لا يرد علي الاتصال 3 مرات )'],
        actions: [['s'], [' نخبره بارفاق صورة للمتجر '], ['اتخاذ  action ضد المندوب حسب ال action plan '], ['يترك الطلب مع كتابة نوت فالطلب ان المندوب متواصل مع العميل '], ['التواصل مع العميل واخباره ان سوف يتم تغير المندوب  وسيتم متابعة الطلب حتي يصل له ']]
    },
    {
        case: ' المندوب وصل للمطعم  علي الخريطة لكن لم يتم تحويل حالة الطلب الي ( picking up )',
        situation: ['after 15 mins ( المندوب يرد علي الاتصال )', 'after 15 mins ( المندوب لا يرد علي الاتصال )'],
        actions: [['1- الاتصال بالمندوب واخباره بتحويل حالة الطلب الي جاري استلام الطلب لكي يظهر للعميل انك تستلم الطلب من المطعم الحين '], ['1 - اذا لم يتم التجواب من قبل المندوب تحويل حالة الطلب من قبل الدعم وارسال رسالة food عبر WHATSAPP']]
    }
];


export const cancelledData: Tabledata[] = [
    {
        case: 'المندوب تأخر في المطعم عن  35 دقيقة  (المندوب يرد )',
        situation: ['المطعم لديه مشكله بالجهاز', 'الطلب يحتاج وقت اكثر من الوقت المحدد', 'المطعم زحمه ', 'المندوب معاه اكثر من طلب'],
        actions: [[`المطعم يرد 
        معرفه المشكلة اللي بتواجهه المطعم و حلها `, `المطعم لا يرد 
        التواصل مع المندوب و التحدث مع الموظف بالمطعم `],
        ['التواصل مع العميل وابلاغه ان الطلب سيتأخر للتحضير '],
        ['ابلاغ العميل حتي يعرف سبب التأخير '],
        ['التأكد ان الطلبين لن يتأخروا و ابلاغ المندوب انه في حاله قبول اكثر من طلب التأكد من توصيلهم في الوقت المحدد ', `في حاله ان الطلبات ستتأخر بسبب بعد المسافة او المطعم اتخاذ الجراء المناسب مع المندوب حسب action plan 
    التواصل مع العميل اولا لابلاغه و عرض عليه تغير المندوب ومتابعه الطلب للعميل `]],
    },
    {
        case: 'المندوب تأخر في المطعم عن  35 دقيقة (المندوب لا يرد )',
        situation: ['المندوب علي تواصل مع العميل في المحادثه وواضح سبب التأخير ', 'المندوب ليس علي تواصل مع العميل في المحادثه وغير واضح سبب التأخير '],
        actions: [['كتابه نوت بالطلب بسبب التاخير '], ['( المطعم يرد )التواصل مع المطعم للتأكد ان المندوب حصل الطلب ', `(المطعم لا يرد ) التواصل مع العميل للتأكد من ان المندوب علي تواصل معه 
        *في حالة ان المندوب لايرد علي العميل و ليس علي تواصل معه تغير المندوب للعميل و تعويضه `]]
    },
    {
        case: 'المندوب وصل المطعم و المطعم مغلق ',
        situation: ['التواصل مع المندوب وابلاغه بارفاق صوره للمطعم و هو مغلق'],
        actions: [['رفع تيكيت لقسم المطاعم و التواصل مع العميل والاعتذار منه وتعويضه واغلاق الطلب ']]
    },
    {
        case: 'المندوب وصل لبيت العميل علي الخريطه و المطعم لم يأكد استلام الطلب',
        situation: ['المطعم يرد التواصل مع المطعم للتأكد من استلام المندوب', 'المطعم لا يرد التواصل مع المندوب لارفاق فاتوره ', 'المطعم لا يرد المندوب ما معه فاتوره'],
        actions: [['تأكيد الاستلام للمندوب وابلاغه بتغير المرحله و استكمال الطلب فور تسليمه '], ['تأكيد الاستلام بعد التأكد من الفاتوره وابلاغ المندوب بتغير المرحله و استكمال الطلب فور تسليمه '], ['التواصل مع العميل للتأكد من استلامه الطلب من نفس المطعم ']]
    },
    {
        case: 'الطلب اون لاين ',
        situation: ['الغي التعاقد مع التطبيق ', 'المطعم ما بيستقبل  الا طلبات كاش ', 'المطعم عنده مشاكل بالفواتير ورفض يسلم الطلب'],
        actions: [[`التواصل مع المطعم لمحاوله حل المشكله واذا رفض المطعم 
        \n1- ابلاغ المندوب للدفع في المطعم وكتابه نوت في الطلب لحين استكماله بتعويض المندوب 
        \n2- رفع تيكيت لقسم المطاعم `]]

    }

]


export const completedData: Tabledata[] = [
    {
        case: ' المندوب وصل علي الخريطه الطلب مر عليه 60 دقيقة',
        situation: ['الطلب اون لاين ( العميل دافع و لم يؤكد الاستلام ) العميل يرد', 'الطلب اون لاين (العميل دافع و لم يؤكد الاستلام ) التطبيق معلق مع العميل ', 'الطلب اون لاين الطلب اقل من 200 ريال ( العميل دافع و لم يؤكد الاستلام )العميل لايرد 3 مرات ', 'الطلب اون لاين الطلب اكثر من 200 ريال  ( العميل دافع و لم يؤكد الاستلام )العميل لايرد 3 مرات ', 'الطلب كاش المندوب يرد ', 'الطلب كاش المندوب لا يرد '],
        actions: [['التأكد من ان العميل استلم الطلب كامل و لا يوجد مشكله و طلب من العميل تأكيد الاستلام '], ['تأكيد الاستلام للعميل وكتابه نوت بالطلب '], ['التأكد من الشات والخريطة ان العميل استلم الطلب و استكماله '], ['إذا المندوب وضح أنه سلم الطلب للعميل يتم متابعة الطلب 30 دقيقة والتواصل مع العميل خلالها وإذ لم يرد نقوم بإستكمال الطلب لحين تواصل العميل معنا'], ['التواصل مع المندوب لاستكمال الطلب', 'التطبيق معلق مع المندوب استكمال الطلب و كتابه نوت بالطلب '], ['التواصل مع العميل للتأكد من استلام الطلب و استكماله وكتابه نوت بالطلب ', 'العميل لا يرد التأكد من المحادثه والخريطة  و استكمال الطلب بناء عليها ']]
    },
    {
        case: 'المندوب امام منزل العميل ومعه الطلب والعميل لا يتجواب لمدة اكثر من 15 دقيقة',
        situation: ['العميل عنده طلبات اون لاين و عميل جاد (الطلب اون لاين )', 'العميل عنده طلبات اون لاين و عميل جاد (الطلب كاش )'],
        actions: [['(طلب أقل من 100) نكتب نوت في حساب العميل نطلب منه تصوير الاغراض ورفعها في الدردشة ثم الغاء الطلب و رفع طلب تعويض للمطعم ', '(طلب أكثر من 100) حظر حساب العميل ونطلب منه تصوير الاغراض ورفعها في الدردشة ثم الغاء الطلب و رفع طلب تعويض للمطعم '], ['(طلب أقل من 100) نكتب نوت في حساب العميل  نطلب منه تصوير الاغراض ورفعها في الدردشة ثم الغاء الطلب و رفع طلب تعويض للمندوب  ', '(طلب أكثر من 100) حظر حساب العميل نطلب منه تصوير الاغراض ورفعها في الدردشة ثم الغاء الطلب و رفع طلب تعويض للمندوب ']]
    },
    {
        case: 'العميل عنده مشكله بالطلب لم يؤكد الاستلام ( اون لاين )',
        situation: ['الطلب ناقص / سئ /مختلف عن الطلب الاساسي '],
        actions: [['ابلاغ العميل بارفاق صور للاغراض و مراجعه الفاتورة ورفع طلب تعويض للعميل ']]

    },
    {
        case: 'الطلب اون لاين ',
        situation: ['العميل ما دفع الطلب (العميل يرد )', 'العميل ما دفع الطلب (العميل لا يرد ) '],
        actions: [[`التواصل مع العميل و معرفه طريقه الدفع 
        \n1- دفع عن طريق التطبيق التأكد من قسم الpayment وكتابه نوت في الطلب 
        \n2-دفع للمندوب كاش رفع تكيت للخصم من المندوب قيمه الطلب `], ['التواصل مع المندوب للتأكد انه استلم حقه و رفع تيكيت للخصم من المندوب ']]

    }


]


export const courierData: Tabledata[] = [
    {
        case: 'المندوب يحصل له ظرف',
        situation: [],
        actions: [[]]
    },

]